In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [42]:
np.random.seed(101)
data = randn(5,4)
data

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [43]:
columns = ['W','X', 'Y', 'Z']
columns

['W', 'X', 'Y', 'Z']

In [44]:
index = ['A', 'B', 'C', 'D', 'E']
index

['A', 'B', 'C', 'D', 'E']

In [45]:
# pd is a module
# dataframe is a class inside the module pd
# df is instance of dataframe class / object of df class
df = pd.DataFrame(data, columns = columns, index=index)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selection and indexing

In [46]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [47]:
df['W']['A']

np.float64(2.706849839399938)

In [48]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [49]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [50]:
df['NEW'] = df['W'] + df['Y']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [51]:
# by default .drop() will search for index (rows)
# to tell pandas look at column by using kargm axis
# default value for axis is 0 which is drop row
# if the axis is set to 1 which is drop column
# drop will not delete permenantly
# drop is a method inside the df object
df.drop('NEW', axis =1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
# 1.    copy the temporarily column
dfdroppedcolumn = df.drop('NEW', axis = 1).copy()
dfdroppedcolumn

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [55]:
# permenantly delete the column
df.drop('NEW', axis = 1, inplace = True)

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
# loc is a property
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [58]:
df.loc[['A']]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [59]:
df.loc[['A', 'C', 'E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df.iloc[[0,2,4]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [61]:
# df.loc[rows, column]
df.loc[['A', 'C', 'E'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813
E  0.190794  2.605967

In [62]:
df.drop('Total', axis = 0, inplace = True, errors = 'ignore')
df.loc['Total'] = df.sum()
df

              W         X         Y         Z
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509
Total  1.719289  2.268822  2.261436  2.159356